jas256/uts-rocketry-project-bird/Firmware/project_bird_v1.0_board_def/avr/boards.txt
##############################################################

uts-rocketry-project-bird.name=UTS Rocketry - Project Bird V1
uts-rocketry-project-bird.vid.0=0x2341
uts-rocketry-project-bird.pid.0=0x0036
uts-rocketry-project-bird.vid.1=0x2341
uts-rocketry-project-bird.pid.1=0x8036
uts-rocketry-project-bird.vid.2=0x2A03
uts-rocketry-project-bird.pid.2=0x0036
uts-rocketry-project-bird.vid.3=0x2A03
uts-rocketry-project-bird.pid.3=0x8036

uts-rocketry-project-bird.upload.tool=avrdude
uts-rocketry-project-bird.upload.protocol=avr109
uts-rocketry-project-bird.upload.maximum_size=28672
uts-rocketry-project-bird.upload.maximum_data_size=2560
uts-rocketry-project-bird.upload.speed=57600
uts-rocketry-project-bird.upload.disable_flushing=true
uts-rocketry-project-bird.upload.use_1200bps_touch=true
uts-rocketry-project-bird.upload.wait_for_upload_port=true

uts-rocketry-project-bird.bootloader.tool=avrdude
uts-rocketry-project-bird.bootloader.low_fuses=0xff
uts-rocketry-project-bird.bootloader.high_fuses=0xd8
uts-rocketry-project-bird.bootloader.extended_fuses=0xcb
uts-rocketry-project-bird.bootloader.file=caterina-projectbird/Caterina-project-bird.hex
uts-rocketry-project-bird.bootloader.unlock_bits=0x3F
uts-rocketry-project-bird.bootloader.lock_bits=0x2F

uts-rocketry-project-bird.build.mcu=atmega32u4
uts-rocketry-project-bird.build.f_cpu=8000000L
uts-rocketry-project-bird.build.vid=0x2341
uts-rocketry-project-bird.build.pid=0x8036
uts-rocketry-project-bird.build.usb_product="Arduino Leonardo"
uts-rocketry-project-bird.build.board=AVR_LEONARDO
uts-rocketry-project-bird.build.core=arduino:arduino
uts-rocketry-project-bird.build.variant=uts-rocketry-project-bird
uts-rocketry-project-bird.build.extra_flags={build.usb_flags}


